yblpoi/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 默认模板只保留 NVS、PHY data 和占用剩余空间的 factory app；用户可按需修改。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
# 界面大数字用的是像素字体 love_font_36(main/love_app.c),Montserrat 只用于
# 纯 ASCII 的 demo 页与像素字体的 fallback,所以只开 14/20 两档。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 只画纯色块、标签和 4bpp 图标,对象数量很少,24KB 足够;
# 历史上为了 demo 菜单的卡片墙 + 吉祥物调到 32KB,那些页面已随 demo 子系统删除。
# 注意这块是从系统堆里切走的:调大会挤掉 Wi-Fi/BLE/HTTP 的余量。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# LVGL 的 examples/ 与 demos/ 默认参与编译,但产品固件不需要它们:
# 编进去只会拖慢构建,而且 examples 里用到 slider/button 等控件,会与下面的
# 控件裁剪互相牵制(关掉控件后 examples 直接编译失败)。一并关闭。
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# LVGL 控件裁剪:界面只用 lv_obj / lv_label / lv_image 与 flex 布局# (main/ui_pixel.c、main/love_app.c、main/main.c),其余控件全部未引用。
# 每个控件的 .c 都有 "#if LV_USE_X != 0" 守卫,关闭后会编译成空单元;
# lv_theme_default 对它们的引用也都在 "#if LV_USE_X" 内,所以可以整批关掉。
# 注意 SLIDER/SPINNER/SCALE 分别以 BAR/ARC/LINE 为基类,必须连同基类一起关。
# 刻意保留:OBJ/LABEL/IMAGE(在用)、FLEX(在用)、DRAW_SW、THEME_DEFAULT、
# BUILTIN_*、ASSERT_*、FONT_PLACEHOLDER(字体兜底)与 OBSERVER。
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_ARC=n
CONFIG_LV_USE_ARCLABEL=n
CONFIG_LV_USE_BAR=n
CONFIG_LV_USE_BUTTON=n
CONFIG_LV_USE_BUTTONMATRIX=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CANVAS=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_GRID=n
CONFIG_LV_USE_IMAGEBUTTON=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LINE=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SLIDER=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_SWITCH=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TEXTAREA=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
# 默认主题已启用,lv_theme_simple 在 lv_display.c 里属于 "#elif" 死分支。
CONFIG_LV_USE_THEME_SIMPLE=n

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- 编译器 ---
# 按体积优化(-Os)。ESP-IDF 默认按调试优化(-Og),会让 app 镜像明显偏大;
# 本项目的瓶颈在 SPI 刷屏与 I2S DMA,不在 CPU,所以 -Os 不会影响观感与时序。
# 断言级别保持默认(ENABLE),不要改成 DISABLE —— 那会把 assert() 变成空操作。
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- SNTP ---
# 设备没有 RTC，时间只能靠网络拿回来，所以配两个服务器做容错。
# 该选项同时决定 esp_sntp_config_t.servers[] 的长度：保持 1 会让第二个
# 服务器在编译期被静默丢弃（excess elements in array initializer）。
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
